{
  "clusters": [
    {
      "canonical_name": "操作系统多媒体内容应用",
      "category": "技术探讨",
      "articles": [
        {
          "title": "How did Windows 95 get permission to put the Weezer video Buddy Holly on the CD?",
          "link": "https://devblogs.microsoft.com/oldnewthing/20260210-00/?p=112052",
          "source": "devblogs.microsoft.com/oldnewthing",
          "summary": "<p>Asking nicely, and asking a lot of people.</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/oldnewthing/20260210-00/?p=112052\">How did Windows 95 get permission to put the Weezer video &lt;I&gt;Buddy Holly&lt;/I&gt; on the CD?</a> appeared first on <a href=\"https://devblogs.microsoft.com/oldnewthing\">The Old New Thing</a>.</p>",
          "content": "<p>Some time ago, I noted that <a href=\"https://devblogs.microsoft.com/oldnewthing/20060103-52/?p=32853\" title=\"Why did the Windows 95 CD have extra fun stuff?\"> the Windows 95 CD contained a variety of multimedia extras</a>, partly because they were fun, and partly to show off Windows 95&#8217;s multimedia capabilities.</p>\n<p>One of those multimedia extras was the music video for the song <i><a href=\"https://en.wikipedia.org/wiki/Buddy_Holly_(song)\">Buddy Holly</a></i> by the band <a href=\"https://en.wikipedia.org/wiki/Weezer\">Weezer</a>. Acquiring permission to redistribute the video took multiple steps.</p>\n<p>First, Microsoft had to secure the rights to the song itself, which was negotiated directly with Weezer&#8217;s publisher Geffen Records, and apparently <a href=\"https://genius.com/a/weezer-had-no-idea-the-music-video-for-buddy-holly-would-be-included-with-windows-95\" title=\"Knowledge Drop: Weezer Had No Idea The Music Video For \"> without the knowledge of the band members themselves</a>. They were reportedly upset that they weren&#8217;t consulted but later realized that it was &#8220;one of the greatest things that could have happened to us. Can you imagine that happening today? It&#8217;s like, there&#8217;s one video on YouTube, and it&#8217;s your video.&#8221;</p>\n<p>But that only secured the rights to the music. What about the video?</p>\n<p>The video takes place in a reconstruction of a location from the <i>Happy Days</i> television program, and clips from that show were spliced into the music video to create the illusion that many of the characters from the show were part of the video. The lawyer responsible for securing the rights to the video had to contact all of the actors from <i>Happy Days</i> to get their permission. That lawyer thoroughly enjoyed the assignment. I don&#8217;t know whether he got to talk to the actors directly, or only to their agents, but I can imagine it being an interesting experience trying to find Henry Winkler&#8217;s ",
          "depth": 0.6,
          "published": "2026-02-10T15:00:00+00:00",
          "category": "技术探讨"
        }
      ],
      "total_mentions": 1,
      "avg_depth": 0.6
    },
    {
      "canonical_name": "欧洲支付系统动态",
      "category": "行业动态",
      "articles": [
        {
          "title": "Pluralistic: Europe takes a big step towards a post-dollar world (11 Feb 2026)",
          "link": "https://pluralistic.net/2026/02/11/post-dollar-world/",
          "source": "pluralistic.net",
          "summary": "Today's links Europe takes a big step towards a post-dollar world: Recapturing $24t worth of transactions from Visa/Mastercard. Hey look at this: Delights to delectate. Object permanence: API for Congress; Steampunk fetish mask; Hillary x AOL login screen; Suffragist Valentines; Musk x Intuit vs the American people. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. Europe takes a big step towards a post-dollar world (permalink) There's a reason every decentralized system eventually finds its way onto a platform: platforms solve real-world problems that platform users struggle to solve for themselves. I've written before about the indie/outsider author Crad Kilodney, who wrote, edited, typeset and published chapbooks of his weird and wonderful fiction, and then sold his books from Toronto street-corners with a sign around his neck reading VERY FAMOUS CANADIAN AUTHOR BUY MY BOOKS (or, if he was feeling spicy, simply: MARGARET ATWOOD): https://pluralistic.net/2024/02/19/crad-kilodney-was-an-outlier/#intermediation Crad was a hell of a writer and a bit of a force of nature, but there are plenty of writers I want to hear from who are never going to publish their own books, much less stand on a street-corner selling them with a MARGARET ATWOOD sign around their necks. Publishers, editors, distributors and booksellers all do important work, allowing writers to get on with their writing, taking all the other parts of the publishing process off their shoulders. That's the value of platforms. The danger of platforms is when they grow so powerful that they usurp the relationship between the parties they are supposed to be facilitating, locking them in and then extracting value from them (someone should coin a word to describe this process!): https://pluralistic.net/2024/11/07/usurpers-helpmeets/#disreintermediation Everyone needs platforms: writers, social media users, people looking for a romantic partner. What's more, the world needs platforms. Say you want to connect all 200+ countries on Earth with high-speed fiber lines; you can run a cable from each country to every other country (about 21,000 cables, many of them expensively draped across the ocean floor), or you can pick one country (preferably one with both Atlantic and Pacific coasts) and run all your cables there, and then interconnect them. That's America, the world's global fiber hub. The problem is, America isn't just a platform for fiber interconnections &#8211; it's a Great Power that uses its position at the center of the world's fiber networks to surveil and disrupt the world's communications networks: https://en.wikipedia.org/wiki/Edward_Snowden That's a classic enshittification move on a geopolitical scale. It's not the only one America's made, either. Consider the US dollar. The dollar is to global commerce what America's fiber head-ends are to the world's data network: a site of essential, (nominally) neutral interchange that is actually a weapon that the US uses to gain advantage over its allies and to punish its enemies: https://pluralistic.net/2023/10/10/weaponized-interdependence/#the-other-swifties The world's also got about 200 currencies. For parties in one country to trade with those in another country, the buyer needs to possess a currency the seller can readily spend. The problem is that setting up 21,000 pairwise exchange markets from every currency to every other currency is expensive and cumbersome &#8211; traders would have to amass reserves of hundreds of rarely used currencies, or they would have to construct long, brittle, expensive, high-risk chains that convert, say, Thai baht into Icelandic kroner to Brazilian reals and finally into Costa Rican colones. Thanks to a bunch of complicated maneuvers following World War II, the world settled on the US dollar as its currency platform. Most important international transactions use \"dollar clearing\" (where goods are priced in USD irrespective of their country of origin) and buyers need only find someone who will convert their currency to dollars in order to buy food, oil, and other essentials. There are two problems with this system. The first is that America has never treated the dollar as a neutral platform; rather, American leaders have found subtle, deniable ways to use \"dollar dominance\" to further America's geopolitical agenda, at the expense of other dollar users (you know, \"enshittification\"). The other problem is that America has become steadily less deniable and subtle in these machinations, finding all kinds of \"exceptional circumstances\" to use the dollar against dollar users: https://pluralistic.net/2025/11/26/difficult-multipolarism/#eurostack America's unabashed dollar weaponization has been getting worse for years, but under Trump, the weaponized dollar has come to constitute an existential risk to the rest of the world, sending them scrambling for alternatives. As November Kelly says, Trump inherited a poker game that was rigged in his favor, but he still flipped over the table because he resents having to pretend to play at all: https://pluralistic.net/2026/01/26/i-dont-want/#your-greenback-dollar Once Trump tried to steal Greenland, it became apparent that the downsides of the dollar far outweigh its upsides. Last month, Christine Lagarde (president of the European Central Bank) made a public announcement on a radio show that Europe \"urgently\" needed to build its own payment system to avoid the American payment duopoly, Visa/Mastercard: https://davekeating.substack.com/p/can-europe-free-itself-from-visamastercard Now, there's plenty of reasons to want to avoid Visa/Mastercard, starting with cost: the companies have raised their prices by more than 40% since the pandemic started (needless to say, updating database entries has not gotten 40% more expensive since 2020). This allows two American companies to impose a tax on the entire global economy, collecting swipe fees and other commissions on $24t worth of the world's transactions every year: https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html But there's another reason to get shut of Visa/Mastercard: Trump controls them. He can order them to cut off payment processing for any individual or institution that displeases him. He's already done this to punish the International Criminal Court for issuing a genocide arrest warrant for Benjamin Netanyahu, and against a Brazilian judge for finding against the criminal dictator Jair Bolsonaro (Trump also threatened to have the judge in Bolsonaro's case assassinated). What's more, Visa/Mastercard have a record of billions (trillions?) of retail transactions taking place between non-Americans, which Trump's officials can access for surveillance purposes, or just to conduct commercial espionage to benefit American firms as a loyalty bonus for the companies that buy the most $TRUMP coins. Two days after Lagarde's radio announcement, 13 European countries announced the formation of \"EuroPA,\" an alliance that will facilitate regionwide transactions that bypass American payment processors (as well as Chinese processors like Alipay): https://news.europawire.eu/european-payment-leaders-sign-mou-to-create-a-sovereign-pan-european-interoperable-payments-network/eu-press-release/2026/02/02/15/34/11/168858/ As European Business Magazine points out, EuroPA is the latest in a succession of attempts to build a European payments network: https://europeanbusinessmagazine.com/business/europes-24-trillion-breakup-with-visa-and-mastercard-has-begun/ There's Wero, a 2024 launch from the 16-country European Payments Initiative, which currently boasts 47m users and 1,100 banks in Belgium, France and Germany, who've spent €7.5b through the network: https://finance.yahoo.com/news/europe-banks-launching-product-break-101215642.html Wero launched as a peer-to-peer payment system that used phone numbers as identifiers, but it expanded into retail at the end of last year, with several large retailers (such as Lidl) signing on to accept Wero payments. Last week, Wero announced an alliance with EuroPA, making another 130m people eligible to use the service, which now covers 72% of the EU and Norway. They're rolling out international peer-to-peer payments in 2026, and retail/ecommerce payments in 2027. These successes are all the more notable for the failures they follow, like Monnet (born 2008, died 2012). Even the EPI has been limping along since its founding, only finding a new vigor on the heels of Trump threatening EU member states with military force if he wasn't given Greenland. As EBM writes, earlier efforts to build a regional payment processor foundered due to infighting among national payment processors within the EU, who jealously guarded their own turf and compulsively ratfucked one another. This left Visa/Mastercard as the best (and often sole) means of conducting cross-border commerce. This produced a \"network effect\" for Visa/Mastercard: since so many Europeans had an American credit card in their wallets, European merchants had to support them; and since so many EU merchants supported Visa/Mastercard, Europeans had to carry them in their wallets. Network effects are pernicious, but not insurmountable. The EU is attacking this problem from multiple angles &#8211; not just through EuroPA, but also through the creation of the Digital Euro, a Central Bank Digital Currency (CBDC). Essentially, this would give any European who signs up an account with the ECB, the federal bank of the Eurozone. Then, using an app or a website, any two Digital Euro customers could transfer funds to one another using the bank's own ledgers, instantaneously and at zero cost. EBM points out that there's a critical difficulty in getting EuroPA off the ground: because it is designed to be cheap to use, it doesn't offer participating banks the windfall profits that Visa/Mastercard enjoy, which might hold back investment in EuroPA infrastructure. But banks are used to making small amounts of money from a lot of people, and with the Digital Euro offering a \"public option,\" the private sector EuroPA system will have a competitor that pushes it to continuously improve its systems. It's true that European payment processing has been slow and halting until now, but that was when European businesses, governments and households could still pretend that the dollar &#8211; and the payment processing companies that come along with it &#8211; was a neutral platform, and not a geopolitical adversary. If there's one thing the EU has demonstrated over the past three years, it's that geopolitical threats from massive, heavily armed mad empires can break longstanding deadlocks. Remember: Putin's invasion of Ukraine and the end of Russian gas moved the EU's climate goals in ways that beggar belief: the region went from 15 years behind on its solar rollout to ten years ahead of schedule in just a handful of months: https://pluralistic.net/2026/02/05/contingency/#this-too-shall-pass This despite an all-out blitz from the fossil fuel lobby, one of the most powerful bodies in the history of civilization. Crises precipitate change, and Trump precipitates crises. Hey look at this (permalink) Killing in the name of… nothing https://www.theverge.com/policy/849609/charlie-kirk-shooting-ideology-literacy-politics Best gas masks https://www.theverge.com/policy/868571/best-gas-masks As Was The Style At The Time: How We Became Cruel https://www.oblomovka.com/wp/2026/02/09/as-was-the-style-at-the-time-how-we-became-cruel/ Remove Your Ring Camera With a Claw Hammer https://www.hamiltonnolan.com/p/remove-your-ring-camera-with-a-claw The truth about covering tech at Bezos’s Washington Post https://geoffreyfowler.substack.com/p/washington-post-layoffs-bezos-tech-reporting Object permanence (permalink) #15yrsago Realtime API for Congress https://web.archive.org/web/20110211101723/http://sunlightlabs.com/blog/2011/the-real-time-congress-api/ #15yrsago Steampunk fetish mask with ear-horn https://bob-basset.livejournal.com/156159.html #10yrsago Facebook’s “Free Basics” and colonialism: an argument in six devastating points https://web.archive.org/web/20160211182436/https://www.theatlantic.com/technology/archive/2016/02/facebook-and-the-new-colonialism/462393/ #10yrsago UK surveillance bill condemned by a Parliamentary committee, for the third time https://web.archive.org/web/20250523013320/https://www.wired.com/story/technology-ip-bill-surveillance-committee/ #10yrsago Haunted by a lack of young voter support, Hillary advertises on the AOL login screen https://web.archive.org/web/20160211080839/http://www.weeklystandard.com/hillary-reaches-base-with-aol-login-page-ad/article/2001023 #10yrsago Celebrate V-Day like an early feminist with these Suffragist Valentines https://web.archive.org/web/20160216100606/https://www.lwv.org/blog/votes-women-vintage-womens-suffrage-valentines #10yrsago Elements of telegraphic style, 1928 https://writeanessayfor.me/telegraph-office-com #10yrsago Disgraced ex-sheriff of LA admits he lied to FBI, will face no more than 6 months in prison https://web.archive.org/web/20160211041117/https://www.latimes.com/local/lanow/la-me-ln-ex-l-a-county-sheriff-baca-jail-scandal-20160210-story.html #5yrsago Apple puts North Dakota on blast https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#manorial-apple #5yrsago Catalytic converter theft https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#ccscrap #5yrsago Adam Curtis on criti-hype https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#hypernormal #5yrsago Dependency Confusion https://pluralistic.net/2021/02/11/rhodium-at-2900-per-oz/#extra-index-url #1yrago Musk steals a billion dollars from low-income Americans and sends it to Intuit https://pluralistic.net/2025/02/11/doubling-up-on-paperwork/#rip-freefile Upcoming appearances (permalink) Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18 https://tanner.utah.edu/center-events/cory-doctorow/ Montreal (remote): Fedimtl, Feb 24 https://fedimtl.ca/ Victoria: 28th Annual Victoria International Privacy &#38; Security Summit, Mar 3-5 https://www.rebootcommunications.com/event/vipss2026/ Berkeley: Bioneers keynote, Mar 27 https://conference.bioneers.org/ Berlin: Re:publica, May 18-20 https://re-publica.com/de/news/rp26-sprecher-cory-doctorow Berlin: Enshittification at Otherland Books, May 19 https://www.otherland-berlin.de/de/event-details/cory-doctorow.html Hay-on-Wye: HowTheLightGetsIn, May 22-25 https://howthelightgetsin.org/festivals/hay/big-ideas-2 Recent appearances (permalink) Panopticon :3 (Trashfuture) https://www.patreon.com/posts/panopticon-3-150395435 America's Enshittification is Canada's Opportunity (Do Not Pass Go) https://www.donotpassgo.ca/p/americas-enshittification-is-canadas Everything Wrong With the Internet and How to Fix It, with Tim Wu (Ezra Klein) https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html How the Internet Got Worse (Masters in Business) https://www.youtube.com/watch?v=auXlkuVhxMo Enshittification (Jon Favreau/Offline): https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/ Latest books (permalink) \"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 \"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025 https://us.macmillan.com/books/9780374619329/enshittification/ \"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (https://us.macmillan.com/books/9781250865908/picksandshovels). \"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (thebezzle.org). \"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (http://lost-cause.org). \"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (http://seizethemeansofcomputation.org). Signed copies at Book Soup (https://www.booksoup.com/book/9781804291245). \"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books http://redteamblues.com. \"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 https://chokepointcapitalism.com Upcoming books (permalink) \"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026 \"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026 \"The Post-American Internet,\" a geopolitical sequel of sorts to Enshittification, Farrar, Straus and Giroux, 2027 \"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2027 \"The Memex Method,\" Farrar, Straus, Giroux, 2027 Colophon (permalink) Today's top sources: Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1027 words today, 26735 total) \"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE. \"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING. A Little Brother short story about DIY insulin PLANNING This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net. https://creativecommons.org/licenses/by/4.0/ Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution. How to get Pluralistic: Blog (no ads, tracking, or data-collection): Pluralistic.net Newsletter (no ads, tracking, or data-collection): https://pluralistic.net/plura-list Mastodon (no ads, tracking, or data-collection): https://mamot.fr/@pluralistic Medium (no ads, paywalled): https://doctorow.medium.com/ Twitter (mass-scale, unrestricted, third-party surveillance and advertising): https://twitter.com/doctorow Tumblr (mass-scale, unrestricted, third-party surveillance and advertising): https://mostlysignssomeportents.tumblr.com/tagged/pluralistic \"When life gives you SARS, you make sarsaparilla\" -Joey \"Accordion Guy\" DeVilla READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer. ISSN: 3066-764X",
          "content": "<p><!--\nTags:\npayment processing, dollar clearing, eu, post-american world, weaponized dollars, forex, Christine Lagarde, digital euro, cbdc, european payments initiative, epi, europa, visa, mastercard, henry farrell, abraham newman, underground empire, wero, payment sovereignty, digital sovereignty, monnet, ecb, finance\n\nSummary:\nEurope takes a big step towards a post-dollar world; Hey look at this; Upcoming appearances; Recent appearances; Latest books; Upcoming books\n\nURL:\nhttps://pluralistic.net/2026/02/11/post-dollar-world/\n\nTitle:\nPluralistic: Europe takes a big step towards a post-dollar world (11 Feb 2026) post-dollar-world\n\nBullet:\n&#x1f686;\n\nSeparator:\n->->->->->->->->->->->->->->->->->->->->->->->->->->->->->->\n\nTop Sources:\nNone\n\n--><br />\n<a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/\"><img class=\"xmasthead_link\" src=\"https://i0.wp.com/craphound.com/images/11Feb2026.jpg?w=840&#038;ssl=1\" /></a></p>\n<h1 class=\"toch1\">Today's links</h1>\n<ul class=\"toc\">\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#de-dollarization\">Europe takes a big step towards a post-dollar world</a>: Recapturing $24t worth of transactions from Visa/Mastercard.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#linkdump\">Hey look at this</a>: Delights to delectate.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#retro\">Object permanence</a>: API for Congress; Steampunk fetish mask; Hillary x AOL login screen; Suffragist Valentines; Musk x Intuit vs the American people.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#upcoming\">Upcoming appearances</a>: Where to find me.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#recent\">Recent appearances</a>: Where I've been.\n</li>\n<li class=\"xToC\"><a href=\"https://pluralistic.net/2026/02/11/post-dollar-world/#latest\">Latest books</a>: You keep readin",
          "depth": 0.8,
          "published": "2026-02-11T10:09:05+00:00",
          "category": "趋势观点"
        }
      ],
      "total_mentions": 1,
      "avg_depth": 0.8
    },
    {
      "canonical_name": "硅谷社区发展",
      "category": "行业动态",
      "articles": [
        {
          "title": "BREAKING: LLM “reasoning” continues to be deeply flawed",
          "link": "https://garymarcus.substack.com/p/breaking-llm-reasoning-continues",
          "source": "garymarcus.substack.com",
          "summary": "A new review underscores the breadth of the problem, and shows that close to a trillion dollars hasn&#8217;t changed that",
          "content": "<p>As you may know, I have been harping on reasoning as a core challenge for deep learning for well over a decade, <a href=\"https://www.newyorker.com/news/news-desk/is-deep-learning-a-revolution-in-artificial-intelligence\">at least since a December 2012 New Yorker article</a>:</p><blockquote><p>&#8220;Realistically, deep learning is only part of the larger challenge of building intelligent machines. Such techniques lack ways of representing causal relationships (such as between diseases and their symptoms), and are <a href=\"http://smash.psych.nyu.edu/courses/spring09/modeling/materials/marcusrethink.pdf\">likely to face challenges</a> in acquiring abstract ideas &#8230; they have no obvious ways of performing logical inferences, and they are also still a long way from integrating abstract knowledge&#8221;</p></blockquote><p>By now many, many others have pounded on the same point.  </p><p>Silicon Valley&#8217;s response has always been to dismiss us. We got this covered, the Valley CEOs will tell you. Pay no attention to Gary or any of the other academics from <a href=\"https://cotopaxi.eas.asu.edu/\">Subbarao Kambhampati</a> to Judea Pearl to Ernest Davis to Ken Forbus to <span class=\"mention-wrap\"></span> to Yann LeCun to Francesca Rossi, and many others (including more recently Ilya Sutskever), who are also skeptical. Ignore <a href=\"https://aaai.org/about-aaai/presidential-panel-on-the-future-of-ai-research/\">the big AAAI survey that said that LLMs won&#8217;t get us to AGI</a>. Surely <a href=\"https://open.substack.com/pub/garymarcus/p/a-knockout-blow-for-llms?r=8tdk6&amp;utm_medium=ios\">that Apple study</a> must be biased too. Give us money. Lots of money. Lots and lots of money. Scale Scale Scale. AGI is coming next year!</p><p>Well, AGI still hasn&#8217;t come (even though they keep issuing the same promises, year after year). LLMs still hallucinate and continue to make boneheaded errors.</p><p>And reasoning is still one of the core issues.</p><p>How serious an ",
          "depth": 0.8,
          "published": "2026-02-10T21:31:52+00:00",
          "category": "技术探讨"
        },
        {
          "title": "Communities are not fungible",
          "link": "https://www.joanwestenberg.com/communities-are-not-fungible/",
          "source": "joanwestenberg.com",
          "summary": "<p>There&apos;s a default assumption baked into how Silicon Valley builds products, and it tracks against how urban planners redesign neighbourhoods: that communities are interchangeable, and if you &quot;lose&quot; one, you can manufacture a replacement; that the value of a group of people who share space and</p>",
          "content": "<img alt=\"Communities are not fungible\" src=\"https://www.joanwestenberg.com/content/images/2026/02/Gemini_Generated_Image_ml841fml841fml84.jpeg\" /><p>There&apos;s a default assumption baked into how Silicon Valley builds products, and it tracks against how urban planners redesign neighbourhoods: that communities are interchangeable, and if you &quot;lose&quot; one, you can manufacture a replacement; that the value of a group of people who share space and history can be captured in a metric and deployed at scale.</p><p>Economists have a word for assets that can be swapped one-for-one without loss of value: fungible. A dollar is fungible. A barrel of West Texas Intermediate crude is fungible. </p><p>...A mass of people bound together by years of shared context, inside jokes and collective memory is not.</p><p>And yet we keep treating communities as though they are.</p><p>When a platform migrates its user base to a new architecture, the implicit promise is that the community will survive the move. When a city demolishes a public housing block and offers residents vouchers for market-rate apartments across town, the implicit promise is that they&apos;ll rebuild what they had.</p><p>These promises are always broken, and the people making them either don&apos;t understand why, or they&apos;re relying on the rest of us being too blind to see it.</p><h2 id=\"what-robert-moses-got-wrong\">What Robert Moses got wrong...</h2><p>Robert Moses displaced an estimated 250,000 people over the course of his career, razing entire neighbourhoods to make way for expressways and public works projects. The defence of Moses, then and now, is utilitarian: more people benefited from the infrastructure than were harmed by its construction. The calculus assumed that the displaced residents could form equivalent communities elsewhere, and the relationships severed by a highway cutting through a block were replaceable with relationships formed in a new location. Jane Jacobs spent much of her caree",
          "depth": 0.8,
          "published": "2026-02-11T04:18:45+00:00",
          "category": "趋势观点"
        }
      ],
      "total_mentions": 2,
      "avg_depth": 0.8
    },
    {
      "canonical_name": "深度学习挑战与趋势",
      "category": "技术探讨",
      "articles": [
        {
          "title": "Last year, all my non-programmer friends built apps",
          "link": "https://idiallo.com/blog/my-non-programmer-friends-built-apps?src=feed",
          "source": "idiallo.com",
          "summary": "<p>Last year, all my non-programmer friends were building apps. Yet today, those apps are nowhere to be found.</p>\n\n<p>Everyone followed the ads. They signed up for Lovable and all the fancy app-building services that exist. My LinkedIn feed was filled with PMs who had discovered new powers. Some posted bullet-point lists of \"things to do to be successful with AI.\" \"Don't work hard, work smart,\" they said, as if it were a deep insight.</p>\n\t\t\t<p>I must admit, I was a bit jealous. With a full-time job, I don't get to work on my cool side project, which has collected enough dust to turn into a dune. There's probably a little mouse living inside. I'll call him Muad'Dib. </p>\n\n<p>What was I talking about? Right. The apps.</p>\n\n<p>Today, my friends are silent. I still see the occasional post on LinkedIn, but they don't garner the engagement they used to. The app-building AI services still exist, but their customers have paused their subscriptions. Here's a conversation I had recently.</p>\n\n<p>A friend had \"vibe-coded\" an Android app. A platform for building communities around common interests. Biking enthusiasts could start a biking community. Cooking fans could gather around recipes. It was a neat idea. While using the app on his phone, swiping through different pages and watching the slick animations, I felt a bit jealous. Then I asked: \"So where is the data stored?\"</p>\n\n<p>\"It's stored on the app,\" he replied.</p>\n\n<p>\"I mean, <em>all</em> the user data,\" I pressed. \"Do you use a database on AWS, or any service like that?\"</p>\n\n<p>We went back and forth while I tried to clarify my question. His vibe-knowing started to show its limits. I felt some relief, my job was safe for now. Joking aside, we talked about servers, app architecture, and even GDPR compliance. These weren't things the AI builder had prepared him for.</p>\n\n<p>This conversation happens often now when I check in on friends who vibe-coded their way into developing an app or website. They felt on top of the world when they were getting started. But then they got stuck. An error message they couldn't debug. The service generating gibberish. Requests the AI couldn't understand. How do you build the backend of an app when you don't know what a backend is? And when the tool asks you to sign up for Google Cloud and start paying monthly fees, what are you supposed to do?</p>\n\n<p>Another friend wanted to build a newsletter. Right now, ChatGPT told him to set up WordPress and learn about SMTP. These are all good things to learn, but the \"S\" in SMTP is a lie. It's not that simple. I've been trying to explain to him why the email he is sending from the command line is not reaching his gmail.</p>\n\n<p>The AI services that promise to build applications are great at making a storefront you don't want to modify. The moment you start customizing, you run into problems. That's why all Lovable websites look exactly the same. These services continue to exist. The marketing is still effective. But few people end up with a product that actually solves their problems.</p>\n\n<p>My friends spent money on these services. They were excited to see a polished brochure. The problem is, they didn't know what it takes to actually run an app.</p>\n\n<p>The AI tools are amazing at generating the visible 20% of an app. But the remaining invisible 80% is where the actual work is. The infrastructure, the security, maintenance, scaling issues, and then the actual cost. The free tier on AWS doesn't last forever. And neither does your enthusiasm when you start paying $200/month for a hobby project. </p>\n\n<p>My friends' experiments weren't failures. They learned something valuable. Some now understand why developers get paid what they do. Some even started taking programming bootcamp. But the rest have moved on. Their app sits dormant in an abandoned github repo. Their domain will probably expire this year.</p>\n\n<p>They're back to their day jobs, a little wiser about the difference between a demo and a product. Their LinkedIn profiles are quieter now, they have stopped posting about \"working smart, not hard.\"</p>\n\n<p>As for me, I should probably check on Muad'Dib. That side project isn't going to build itself. AI or no AI.</p>",
          "content": "<p>Last year, all my non-programmer friends were building apps. Yet today, those apps are nowhere to be found.</p>\n\n<p>Everyone followed the ads. They signed up for Lovable and all the fancy app-building services that exist. My LinkedIn feed was filled with PMs who had discovered new powers. Some posted bullet-point lists of \"things to do to be successful with AI.\" \"Don't work hard, work smart,\" they said, as if it were a deep insight.</p>\n\t\t\t<p>I must admit, I was a bit jealous. With a full-time job, I don't get to work on my cool side project, which has collected enough dust to turn into a dune. There's probably a little mouse living inside. I'll call him Muad'Dib. </p>\n\n<p>What was I talking about? Right. The apps.</p>\n\n<p>Today, my friends are silent. I still see the occasional post on LinkedIn, but they don't garner the engagement they used to. The app-building AI services still exist, but their customers have paused their subscriptions. Here's a conversation I had recently.</p>\n\n<p>A friend had \"vibe-coded\" an Android app. A platform for building communities around common interests. Biking enthusiasts could start a biking community. Cooking fans could gather around recipes. It was a neat idea. While using the app on his phone, swiping through different pages and watching the slick animations, I felt a bit jealous. Then I asked: \"So where is the data stored?\"</p>\n\n<p>\"It's stored on the app,\" he replied.</p>\n\n<p>\"I mean, <em>all</em> the user data,\" I pressed. \"Do you use a database on AWS, or any service like that?\"</p>\n\n<p>We went back and forth while I tried to clarify my question. His vibe-knowing started to show its limits. I felt some relief, my job was safe for now. Joking aside, we talked about servers, app architecture, and even GDPR compliance. These weren't things the AI builder had prepared him for.</p>\n\n<p>This conversation happens often now when I check in on friends who vibe-coded their way into developing an app or website. They felt on top of t",
          "depth": 0.8,
          "published": "2026-02-11T12:00:00+00:00",
          "category": "趋势观点"
        }
      ],
      "total_mentions": 1,
      "avg_depth": 0.8
    },
    {
      "canonical_name": "AI在银行业应用",
      "category": "行业动态",
      "articles": [
        {
          "title": "Some disconcerting facts about AI and banking that may have profound consequences",
          "link": "https://garymarcus.substack.com/p/some-disconcerting-facts-about-ai",
          "source": "garymarcus.substack.com",
          "summary": "Disturbing new numbers",
          "content": "<p></p><div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" href=\"https://substackcdn.com/image/fetch/$s_!QW0G!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F700d1313-5b97-4df5-9be3-e0621165d55b_1536x751.png\" target=\"_blank\"><div class=\"image2-inset\"><source type=\"image/webp\" /><img alt=\"\" class=\"sizing-normal\" height=\"712\" src=\"https://substackcdn.com/image/fetch/$s_!QW0G!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F700d1313-5b97-4df5-9be3-e0621165d55b_1536x751.png\" width=\"1456\" /><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button class=\"pencraft pc-reset pencraft icon-container restack-image\" tabindex=\"0\" type=\"button\"><svg fill=\"none\" height=\"20\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button class=\"pencraft pc-reset pencraft icon-container view-image\" tabindex=\"0\" type=\"button\"><svg class=\"lucide lucide-maximize2 lucide-maximize-2\" fill=\"none\" height=\"20\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" viewBox=\"0 0 24 24\" width=\"20\" xmlns=\"http://www.w3.org/2000/svg\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></di",
          "depth": 0.8,
          "published": "2026-02-10T16:51:06+00:00",
          "category": "行业动态"
        }
      ],
      "total_mentions": 1,
      "avg_depth": 0.8
    },
    {
      "canonical_name": "电视技术发展",
      "category": "技术探讨",
      "articles": [
        {
          "title": "The last Sony CRT ever made",
          "link": "https://dfarq.homeip.net/the-last-sony-crt-ever-made/?utm_source=rss&utm_medium=rss&utm_campaign=the-last-sony-crt-ever-made",
          "source": "dfarq.homeip.net",
          "summary": "<p>On February 14, 2006, Sony announced its final CRT television, the KD-34XBR970. The last Sony CRT TV was a 34-inch model, with high definition and a 16:9 screen. So it wasn&#8217;t what we typically think of when it comes to</p>\n<p>The post <a href=\"https://dfarq.homeip.net/the-last-sony-crt-ever-made/\">The last Sony CRT ever made</a> appeared first on <a href=\"https://dfarq.homeip.net\">The Silicon Underground</a>.</p>",
          "content": "<p>On February 14, 2006, Sony announced its final CRT television, the KD-34XBR970. The last Sony CRT TV was a 34-inch model, with high definition and a 16:9 screen. So it wasn&#8217;t what we typically think of when it comes to</p>\n<p>The post <a href=\"https://dfarq.homeip.net/the-last-sony-crt-ever-made/\">The last Sony CRT ever made</a> appeared first on <a href=\"https://dfarq.homeip.net\">The Silicon Underground</a>.</p>",
          "depth": 0.8,
          "published": "2026-02-11T12:00:53+00:00",
          "category": "行业动态"
        }
      ],
      "total_mentions": 1,
      "avg_depth": 0.8
    },
    {
      "canonical_name": "软件供应链安全",
      "category": "技术探讨",
      "articles": [
        {
          "title": "Introducing Showboat and Rodney, so agents can demo what they’ve built",
          "link": "https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#atom-everything",
          "source": "simonwillison.net",
          "summary": "<p>A key challenge working with coding agents is having them both test what they’ve built and demonstrate that software to you, their overseer. This goes beyond automated tests - we need artifacts that show their progress and help us see exactly what the agent-produced software is able to do. I’ve just released two new tools aimed at this problem: <a href=\"https://github.com/simonw/showboat\">Showboat</a> and <a href=\"https://github.com/simonw/rodney\">Rodney</a>.</p>\n\n<ul>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#proving-code-actually-works\">Proving code actually works</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#showboat-agents-build-documents-to-demo-their-work\">Showboat: Agents build documents to demo their work</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#rodney-cli-browser-automation-designed-to-work-with-showboat\">Rodney: CLI browser automation designed to work with Showboat</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#test-driven-development-helps-but-we-still-need-manual-testing\">Test-driven development helps, but we still need manual testing</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#i-built-both-of-these-tools-on-my-phone\">I built both of these tools on my phone</a></li>\n</ul>\n\n<h4 id=\"proving-code-actually-works\">Proving code actually works</h4>\n<p>I recently wrote about how the job of a software engineer isn't to write code, it's to <em><a href=\"https://simonwillison.net/2025/Dec/18/code-proven-to-work/\">deliver code that works</a></em>. A big part of that is proving to ourselves and to other people that the code we are responsible for behaves as expected.</p>\n<p>This becomes even more important - and challenging - as we embrace coding agents as a core part of our software development process.</p>\n<p>The more code we churn out with agents, the more valuable tools are that reduce the amount of manual QA time we need to spend.</p>\n<p>One of the most interesting things about <a href=\"https://simonwillison.net/2026/Feb/7/software-factory/\">the StrongDM software factory model</a> is how they ensure that their software is well tested and delivers value despite their policy that \"code must not be reviewed by humans\". Part of their solution involves expensive swarms of QA agents running through \"scenarios\" to exercise their software. It's fascinating, but I don't want to spend thousands of dollars on QA robots if I can avoid it!</p>\n<p>I need tools that allow agents to clearly demonstrate their work to me, while minimizing the opportunities for them to cheat about what they've done.</p>\n\n<h4 id=\"showboat-agents-build-documents-to-demo-their-work\">Showboat: Agents build documents to demo their work</h4>\n<p><strong><a href=\"https://github.com/simonw/showboat\">Showboat</a></strong> is the tool I built to help agents demonstrate their work to me.</p>\n<p>It's a CLI tool (a Go binary, optionally <a href=\"https://simonwillison.net/2026/Feb/4/distributing-go-binaries/\">wrapped in Python</a> to make it easier to install) that helps an agent construct a Markdown document demonstrating exactly what their newly developed code can do.</p>\n<p>It's not designed for humans to run, but here's how you would run it anyway:</p>\n<div class=\"highlight highlight-source-shell\"><pre>showboat init demo.md <span class=\"pl-s\"><span class=\"pl-pds\">'</span>How to use curl and jq<span class=\"pl-pds\">'</span></span>\nshowboat note demo.md <span class=\"pl-s\"><span class=\"pl-pds\">\"</span>Here's how to use curl and jq together.<span class=\"pl-pds\">\"</span></span>\nshowboat <span class=\"pl-c1\">exec</span> demo.md bash <span class=\"pl-s\"><span class=\"pl-pds\">'</span>curl -s https://api.github.com/repos/simonw/rodney | jq .description<span class=\"pl-pds\">'</span></span>\nshowboat note demo.md <span class=\"pl-s\"><span class=\"pl-pds\">'</span>And the curl logo, to demonstrate the image command:<span class=\"pl-pds\">'</span></span>\nshowboat image demo.md <span class=\"pl-s\"><span class=\"pl-pds\">'</span>curl -o curl-logo.png https://curl.se/logo/curl-logo.png &amp;&amp; echo curl-logo.png<span class=\"pl-pds\">'</span></span></pre></div>\n<p>Here's what the result looks like if you open it up in VS Code and preview the Markdown:</p>\n<p><img alt=\"Screenshot showing a Markdown file &quot;demo.md&quot; side-by-side with its rendered preview. The Markdown source (left) shows: &quot;# How to use curl and jq&quot;, italic timestamp &quot;2026-02-10T01:12:30Z&quot;, prose &quot;Here's how to use curl and jq together.&quot;, a bash code block with &quot;curl -s https://api.github.com/repos/simonw/rodney | jq .description&quot;, output block showing '&quot;CLI tool for interacting with the web&quot;', text &quot;And the curl logo, to demonstrate the image command:&quot;, a bash {image} code block with &quot;curl -o curl-logo.png https://curl.se/logo/curl-logo.png &amp;&amp; echo curl-logo.png&quot;, and a Markdown image reference &quot;2056e48f-2026-02-10&quot;. The rendered preview (right) displays the formatted heading, timestamp, prose, styled code blocks, and the curl logo image in dark teal showing &quot;curl://&quot; with circuit-style design elements.\" src=\"https://static.simonwillison.net/static/2026/curl-demo.jpg\" /></p>\n<p>Here's that <a href=\"https://gist.github.com/simonw/fb0b24696ed8dd91314fe41f4c453563#file-demo-md\">demo.md file in a Gist</a>.</p>\n<p>So a sequence of <code>showboat init</code>, <code>showboat note</code>, <code>showboat exec</code> and <code>showboat image</code> commands constructs a Markdown document one section at a time, with the output of those <code>exec</code> commands automatically added to the document directly following the commands that were run.</p>\n<p>The <code>image</code> command is a little special - it looks for a file path to an image in the output of the command and copies that image to the current folder and references it in the file.</p>\n<p>That's basically the whole thing! There's a <code>pop</code> command to remove the most recently added section if something goes wrong, a <code>verify</code> command to re-run the document and check nothing has changed (I'm not entirely convinced by the design of that one) and a <code>extract</code> command that reverse-engineers the CLI commands that were used to create the document.</p>\n<p>It's pretty simple - just 172 lines of Go.</p>\n<p>I packaged it up with my <a href=\"https://github.com/simonw/go-to-wheel\">go-to-wheel</a> tool which means you can run it without even installing it first like this:</p>\n<div class=\"highlight highlight-source-shell\"><pre>uvx showboat --help</pre></div>\n<p>That <code>--help</code> command is really important: it's designed to provide a coding agent with <em>everything it needs to know</em> in order to use the tool. Here's <a href=\"https://github.com/simonw/showboat/blob/main/help.txt\">that help text in full</a>.</p>\n<p>This means you can pop open Claude Code and tell it:</p>\n<blockquote>\n<p><code>Run \"uvx showboat --help\" and then use showboat to create a demo.md document describing the feature you just built</code></p>\n</blockquote>\n<p>And that's it! The <code>--help</code> text acts <a href=\"https://simonwillison.net/2025/Oct/16/claude-skills/\">a bit like a Skill</a>. Your agent can read the help text and use every feature of Showboat to create a document that demonstrates whatever it is you need demonstrated.</p>\n<p>Here's a fun trick: if you set Claude off to build a Showboat document you can pop that open in VS Code and watch the preview pane update in real time as the agent runs through the demo. It's a bit like having your coworker talk you through their latest work in a screensharing session.</p>\n<p>And finally, some examples. Here are documents I had Claude create using Showboat to help demonstrate features I was working on in other projects:</p>\n<ul>\n<li>\n<a href=\"https://github.com/simonw/showboat-demos/blob/main/shot-scraper/README.md\">shot-scraper: A Comprehensive Demo</a> runs through the full suite of features of my <a href=\"https://shot-scraper.datasette.io/\">shot-scraper</a> browser automation tool, mainly to exercise the <code>showboat image</code> command.</li>\n<li>\n<a href=\"https://github.com/simonw/sqlite-history-json/blob/main/demos/cli.md\">sqlite-history-json CLI demo</a> demonstrates the CLI feature I added to my new <a href=\"https://github.com/simonw/sqlite-history-json\">sqlite-history-json</a> Python library.\n<ul>\n<li>\n<p><a href=\"https://github.com/simonw/sqlite-history-json/blob/main/demos/row-state-sql.md\">row-state-sql CLI Demo</a> shows a new <code>row-state-sql</code> command I added to that same project.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/simonw/sqlite-history-json/blob/main/demos/change-grouping.md\">Change grouping with Notes</a> demonstrates another feature where groups of changes within the same transaction can have a note attached to them.</p>\n</li>\n</ul>\n</li>\n<li>\n<a href=\"https://github.com/simonw/research/blob/main/libkrun-go-cli-tool/demo.md\">krunsh: Pipe Shell Commands to an Ephemeral libkrun MicroVM</a> is a particularly convoluted example where I managed to get Claude Code for web to run a libkrun microVM inside a QEMU emulated Linux environment inside the Claude gVisor sandbox.</li>\n</ul>\n<p>I've now used Showboat often enough that I've convinced myself of its utility.</p>\n<p>(I've also seen agents cheat! Since the demo file is Markdown the agent will sometimes edit that file directly rather than using Showboat, which could result in command outputs that don't reflect what actually happened. Here's <a href=\"https://github.com/simonw/showboat/issues/12\">an issue about that</a>.)</p>\n<h4 id=\"rodney-cli-browser-automation-designed-to-work-with-showboat\">Rodney: CLI browser automation designed to work with Showboat</h4>\n<p>Many of the projects I work on involve web interfaces. Agents often build entirely new pages for these, and I want to see those represented in the demos.</p>\n<p>Showboat's image feature was designed to allow agents to capture screenshots as part of their demos, originally using my <a href=\"https://shot-scraper.datasette.io/\">shot-scraper tool</a> or <a href=\"https://www.playwright.dev\">Playwright</a>.</p>\n<p>The Showboat format benefits from CLI utilities. I went looking for good options for managing a multi-turn browser session from a CLI and came up short, so I decided to try building something new.</p>\n<p>Claude Opus 4.6 pointed me to the <a href=\"https://github.com/go-rod/rod\">Rod</a> Go library for interacting with the Chrome DevTools protocol. It's fantastic - it provides a comprehensive wrapper across basically everything you can do with automated Chrome, all in a self-contained library that compiles to a few MBs.</p>\n<p>All Rod was missing was a CLI.</p>\n<p>I built the first version <a href=\"https://github.com/simonw/research/blob/main/go-rod-cli/README.md\">as an asynchronous report prototype</a>, which convinced me it was worth spinning out into its own project.</p>\n<p>I called it Rodney as a nod to the Rod library it builds on and a reference to <a href=\"https://en.wikipedia.org/wiki/Only_Fools_and_Horses\">Only Fools and Horses</a> - and because the package name was available on PyPI.</p>\n<p>You can run Rodney using <code>uvx rodney</code> or install it like this:</p>\n<div class=\"highlight highlight-source-shell\"><pre>uv tool install rodney</pre></div>\n<p>(Or grab a Go binary <a href=\"https://github.com/simonw/rodney/releases/\">from the releases page</a>.)</p>\n<p>Here's a simple example session:</p>\n<div class=\"highlight highlight-source-shell\"><pre>rodney start <span class=\"pl-c\"><span class=\"pl-c\">#</span> starts Chrome in the background</span>\nrodney open https://datasette.io/\nrodney js <span class=\"pl-s\"><span class=\"pl-pds\">'</span>Array.from(document.links).map(el =&gt; el.href).slice(0, 5)<span class=\"pl-pds\">'</span></span>\nrodney click <span class=\"pl-s\"><span class=\"pl-pds\">'</span>a[href=\"/for\"]<span class=\"pl-pds\">'</span></span>\nrodney js location.href\nrodney js document.title\nrodney screenshot datasette-for-page.png\nrodney stop</pre></div>\n<p>Here's what that looks like in the terminal:</p>\n<p><img alt=\";~ % rodney start\nChrome started (PID 91462)\nDebug URL: ws://127.0.0.1:64623/devtools/browser/cac6988e-8153-483b-80b9-1b75c611868d\n~ % rodney open https://datasette.io/\nDatasette: An open source multi-tool for exploring and publishing data\n~ % rodney js 'Array.from(document.links).map(el =&gt; el.href).slice(0, 5)'\n[\n&quot;https://datasette.io/for&quot;,\n&quot;https://docs.datasette.io/en/stable/&quot;,\n&quot;https://datasette.io/tutorials&quot;,\n&quot;https://datasette.io/examples&quot;,\n&quot;https://datasette.io/plugins&quot;\n]\n~ % rodney click 'a[href=&quot;/for&quot;]'\nClicked\n~ % rodney js location.href\nhttps://datasette.io/for\n~ % rodney js document.title\nUse cases for Datasette\n~ % rodney screenshot datasette-for-page.png\ndatasette-for-page.png\n~ % rodney stop\nChrome stopped\" src=\"https://static.simonwillison.net/static/2026/rodney-demo.jpg\" /></p>\n<p>As with Showboat, this tool is not designed to be used by humans! The goal is for coding agents to be able to run <code>rodney --help</code> and see everything they need to know to start using the tool. You can see <a href=\"https://github.com/simonw/rodney/blob/main/help.txt\">that help output</a> in the GitHub repo.</p>\n<p>Here are three demonstrations of Rodney that I created using Showboat:</p>\n<ul>\n<li>\n<a href=\"https://github.com/simonw/showboat-demos/blob/main/rodney/README.md\">Rodney's original feature set</a>, including screenshots of pages and executing JavaScript.</li>\n<li>\n<a href=\"https://github.com/simonw/rodney/blob/main/notes/accessibility-features/README.md\">Rodney's new accessibility testing features</a>, built during development of those features to show what they could do.</li>\n<li>\n<a href=\"https://github.com/simonw/showboat-demos/blob/main/datasette-database-page-accessibility-audit/README.md\">Using those features to run a basic accessibility audit of a page</a>. I was impressed at how well Claude Opus 4.6 responded to the prompt \"Use showboat and rodney to perform an accessibility audit of <a href=\"https://latest.datasette.io/fixtures\">https://latest.datasette.io/fixtures</a>\" - <a href=\"https://gisthost.github.io/?dce6b2680db4b05c04469ed8f251eb34/index.html\">transcript here</a>.</li>\n</ul>\n<h4 id=\"test-driven-development-helps-but-we-still-need-manual-testing\">Test-driven development helps, but we still need manual testing</h4>\n<p>After being a career-long skeptic of the test-first, maximum test coverage school of software development (I like <a href=\"https://simonwillison.net/2022/Oct/29/the-perfect-commit/#tests\">tests included</a> development instead) I've recently come around to test-first processes as a way to force agents to write only the code that's necessary to solve the problem at hand.</p>\n<p>Many of my Python coding agent sessions start the same way:</p>\n<blockquote>\n<p><code>Run the existing tests with \"uv run pytest\". Build using red/green TDD.</code></p>\n</blockquote>\n<p>Telling the agents how to run the tests doubles as an indicator that tests on this project exist and matter. Agents will read existing tests before writing their own so having a clean test suite with good patterns makes it more likely they'll write good tests of their own.</p>\n<p>The frontier models all understand that \"red/green TDD\" means they should write the test first, run it and watch it fail and then write the code to make it pass - it's a convenient shortcut.</p>\n<p>I find this greatly increases the quality of the code and the likelihood that the agent will produce the right thing with the smallest amount of prompts to guide it.</p>\n<p>But anyone who's worked with tests will know that just because the automated tests pass doesn't mean the software actually works! That’s the motivation behind Showboat and Rodney - I never trust any feature until I’ve seen it running with my own eye.</p>\n<p>Before building Showboat I'd often add a “manual” testing step to my agent sessions, something like:</p>\n<blockquote>\n<p><code>Once the tests pass, start a development server and exercise the new feature using curl</code></p>\n</blockquote>\n<h4 id=\"i-built-both-of-these-tools-on-my-phone\">I built both of these tools on my phone</h4>\n<p>Both Showboat and Rodney started life as Claude Code for web projects created via the Claude iPhone app. Most of the ongoing feature work for them happened in the same way.</p>\n<p>I'm still a little startled at how much of my coding work I get done on my phone now, but I'd estimate that the majority of code I ship to GitHub these days was written for me by coding agents driven via that iPhone app.</p>\n<p>I initially designed these two tools for use in asynchronous coding agent environments like Claude Code for the web. So far that's working out really well.</p>\n    \n        <p>Tags: <a href=\"https://simonwillison.net/tags/go\">go</a>, <a href=\"https://simonwillison.net/tags/projects\">projects</a>, <a href=\"https://simonwillison.net/tags/testing\">testing</a>, <a href=\"https://simonwillison.net/tags/markdown\">markdown</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/coding-agents\">coding-agents</a>, <a href=\"https://simonwillison.net/tags/async-coding-agents\">async-coding-agents</a></p>",
          "content": "<p>A key challenge working with coding agents is having them both test what they’ve built and demonstrate that software to you, their overseer. This goes beyond automated tests - we need artifacts that show their progress and help us see exactly what the agent-produced software is able to do. I’ve just released two new tools aimed at this problem: <a href=\"https://github.com/simonw/showboat\">Showboat</a> and <a href=\"https://github.com/simonw/rodney\">Rodney</a>.</p>\n\n<ul>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#proving-code-actually-works\">Proving code actually works</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#showboat-agents-build-documents-to-demo-their-work\">Showboat: Agents build documents to demo their work</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#rodney-cli-browser-automation-designed-to-work-with-showboat\">Rodney: CLI browser automation designed to work with Showboat</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#test-driven-development-helps-but-we-still-need-manual-testing\">Test-driven development helps, but we still need manual testing</a></li>\n  <li><a href=\"https://simonwillison.net/2026/Feb/10/showboat-and-rodney/#i-built-both-of-these-tools-on-my-phone\">I built both of these tools on my phone</a></li>\n</ul>\n\n<h4 id=\"proving-code-actually-works\">Proving code actually works</h4>\n<p>I recently wrote about how the job of a software engineer isn't to write code, it's to <em><a href=\"https://simonwillison.net/2025/Dec/18/code-proven-to-work/\">deliver code that works</a></em>. A big part of that is proving to ourselves and to other people that the code we are responsible for behaves as expected.</p>\n<p>This becomes even more important - and challenging - as we embrace coding agents as a core part of our software development process.</p>\n<p>The more code we churn out with agents, the more valuable tools are that",
          "depth": 0.7,
          "published": "2026-02-10T17:45:29+00:00",
          "category": "技术探讨"
        },
        {
          "title": "Package Management Consulting",
          "link": "https://nesbitt.io/2026/02/11/package-management-consulting.html",
          "source": "nesbitt.io",
          "summary": "I'm now available for consulting on package management, software supply chain security, and open source infrastructure.",
          "content": "<p>I’m now taking on consulting work. If you’re building or running a package manager, registry, or dependency tooling, I can probably help.</p>\n\n<p>Over fifteen years I’ve built <a href=\"https://libraries.io\">Libraries.io</a>, <a href=\"https://ecosyste.ms\">Ecosyste.ms</a>, <a href=\"https://github.com/andrew/git-pkgs\">git-pkgs</a>, the <a href=\"https://manifest.fm\">Manifest podcast</a>, co-organised the <a href=\"https://fosdem.org/2025/schedule/track/package-management/\">Package Management devroom at FOSDEM</a>, and contributed to <a href=\"https://brew.sh\">Homebrew</a>. I’ve written integrations for dozens of package managers, tracked billions of dependency relationships, and watched the same design mistakes repeat across ecosystems for a decade. That pattern recognition is what I bring to consulting engagements.</p>\n\n<h2 id=\"what-i-can-help-with\">What I can help with</h2>\n\n<p><strong>Package manager design &amp; architecture.</strong> If you’re building a package manager, registry, or dependency resolver, or trying to fix one, I can help you avoid the mistakes that RubyGems, npm, and PyPI learned the hard way. I’ve documented the design patterns, tradeoffs, and failure modes across dozens of ecosystems in my <a href=\"https://nesbitt.io/package-managers/\">cross-ecosystem package manager documentation</a>. Namespace design, version constraint semantics, lockfile formats, registry APIs, lifecycle hooks, trust models.</p>\n\n<p><strong>Software supply chain security.</strong> I’ve found and catalogued dependency confusion attacks, typosquatting campaigns, <a href=\"https://en.wikipedia.org/wiki/Slopsquatting\">slopsquatting</a> (a term I popularized), malicious maintainer takeovers, and protestware incidents across every major ecosystem. Trusted publishing, SBOM generation and enrichment, vulnerability scanning strategy. I know what actually works and what’s security theatre.</p>\n\n<p><strong>Package management governance.</strong> Registries aren’t just technical systems. ",
          "depth": 0.7,
          "published": "2026-02-11T10:00:00+00:00",
          "category": "实战技巧"
        }
      ],
      "total_mentions": 2,
      "avg_depth": 0.7
    },
    {
      "canonical_name": "职场经验与反思",
      "category": "行业动态",
      "articles": [
        {
          "title": "On screwing up",
          "link": "https://seangoedecke.com/screwing-up/",
          "source": "seangoedecke.com",
          "summary": "<p>The most shameful thing I did in the workplace was lie to a colleague. It was about ten years ago, I was a fresh-faced intern, and in the rush to deliver something I’d skipped the step of testing my work in staging<sup id=\"fnref-1\"><a class=\"footnote-ref\" href=\"#fn-1\">1</a></sup>. It did not work. When deployed to production, it didn’t work there either. No big deal, in general terms: the page we were working on wasn’t yet customer-facing. But my colleague asked me over his desk whether this worked when I’d tested it, and I said something like “it sure did, no idea what happened”.</p>\n<p>I bet he forgot about it immediately. I could have just messed up the testing (for instance, by accidentally running some different code than the code I pushed), or he knew I’d probably lied, and didn’t really care. I haven’t forgotten about it. Even a decade later, I’m still ashamed to write it down.</p>\n<p>Of course I’m not ashamed about the <em>mistake</em>. I was sloppy to not test my work, but I’ve cut corners since then when I felt it was necessary, and I stand by that decision. I’m ashamed about how I handled it. But even that I understand. I was a kid, trying to learn quickly and prove I belonged in tech. The last thing I wanted to do was to dwell on the way I screwed up. If I were in my colleague’s shoes now, I’d have brushed it off too<sup id=\"fnref-2\"><a class=\"footnote-ref\" href=\"#fn-2\">2</a></sup>. How do I try to handle mistakes now?</p>\n<h3>Handling the emotional reaction</h3>\n<p>The most important thing is to <strong>control your emotions</strong>. If you’re anything like me, your strongest emotional reactions at work will be reserved for the times you’ve screwed up. There are usually two countervailing emotions at play here: the desire to defend yourself, find excuses, and minimize the consequences; and the desire to confess your guilt, abase yourself, and beg for forgiveness. Both of these are traps. </p>\n<p>Obviously making excuses for yourself (or flat-out denying the mistake, like I did) is bad. But going in the other direction and publicly beating yourself up about it is <em>just as bad</em>. It’s bad for a few reasons.</p>\n<p>First, you’re effectively asking the people around you to take the time and effort to reassure you, when they should be focused on the problem. Second, you’re taking yourself out of the group of people who are focused on the problem, when often you’re the best situated to figure out what to do: since it’s your mistake, you have the most context. Third, it’s just not professional. </p>\n<p>So what should you do? <strong>For the first little while, <em>do nothing</em>.</strong> Emotional reactions fade over time. Try and just ride out the initial jolt of realizing you screwed up, and the impulse to leap into action to fix it. Most of the worst reactions to screwing up happen in the immediate aftermath, so if you can simply do nothing during that period you’re already off to a good start. For me, this takes about thirty seconds. How much time you’ll need depends on you, but hopefully it’s under ten minutes. More than that and you might need to grit your teeth and work through it.</p>\n<h3>Communicate</h3>\n<p>Once you’re confident you’re under control, the next step is to <strong>tell people what happened</strong>. Typically you want to tell your manager, but depending on the problem it could also be a colleague or someone else. It’s really important here to be matter-of-fact about it, or you risk falling into the “I’m so terrible, please reassure me” trap I discussed above. You often don’t even need to explicitly say “I made a mistake”, if it’s obvious from context. Just say “I deployed a change and it’s broken X feature” (or whatever the problem is).</p>\n<p>You should do this <em>before</em> you’ve come up with a solution. It’s tempting to try to conceal your mistake and just quietly solve it. But for user-facing mistakes, concealment is impossible - somebody will raise a ticket eventually - and if you don’t communicate the issue, you risk someone else discovering it and independently raising it.</p>\n<p>In the worst case, while you’re quietly working on a fix, you’ll discover that somebody else has declared an incident. Of course, you understand the problem perfectly (since you caused it), and you know that it was caused by a bad deploy and is easily fixable. But the other people on the incident call don’t know all that. They’re thinking about the worst-case scenarios, wondering if it’s database or network-related, paging in all kinds of teams, causing all kinds of hassle. All of that could have been avoided if you had reported the issue immediately.</p>\n<p>In my experience, tech company managers will forgive mistakes<sup id=\"fnref-3\"><a class=\"footnote-ref\" href=\"#fn-3\">3</a></sup>, but <strong>they won’t forgive being made to look like a fool</strong>. In particular, they won’t forgive being deprived of critical information. If they’re asked to explain the incident by their boss, and they have to flounder around because they lack the context <em>that you had all along</em>, that may harm your relationship with them for good. On the other hand, if you give them a clear summary of the problem right away, and they’re able to seem like they’re on top of things to their manager, you <em>might</em> even earn credit for the situation (despite having caused it with your initial mistake).</p>\n<h3>Accept that it’s going to hurt</h3>\n<p>However, you probably won’t earn credit. This is where I diverge from the popular software engineering wisdom that incidents are always the fault of systems, never of individuals. Of course incidents are caused by the interactions of complex systems. Everything in the universe is caused by the interactions of complex systems! But one cause in that chain is often <em>somebody screwing up</em><sup id=\"fnref-4\"><a class=\"footnote-ref\" href=\"#fn-4\">4</a></sup>.</p>\n<p>If you’re a manager of an engineering organization, and you want a project to succeed, you probably have a mental shortlist of the engineers in your org who can reliably lead projects<sup id=\"fnref-5\"><a class=\"footnote-ref\" href=\"#fn-5\">5</a></sup>. If an engineer screws up repeatedly, they’re likely to drop off that list (or at least get an asterisk next to their name).</p>\n<p>It doesn’t really matter if you had a good technical reason to make the mistake, or if it’s excusable. Managers don’t care about that stuff, because they simply don’t have the technical context to know if it’s true or if you’re just trying to talk your way out of it. What managers do have the context to evaluate is <em>results</em>, so that’s what they judge you on. That means some failures are acceptable, so long as you’ve got enough successes to balance them out.</p>\n<p>Being a strong engineer is about finding a balance between <a href=\"/being-right-a-lot\">always being right</a> and <a href=\"/taking-a-position\">taking risks</a>. If you prioritize always being right, you can probably avoid making mistakes, but you won’t be able to lead projects (since that always requires taking risks). Therefore, <strong>the optimal amount of mistakes at work is not zero.</strong> Unless you’re working in a few select industries<sup id=\"fnref-6\"><a class=\"footnote-ref\" href=\"#fn-6\">6</a></sup>, you should <em>expect</em> to make mistakes now and then, otherwise you’re likely working far too slow. </p>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn-1\">\n<p>From memory, I think I <em>had</em> tested an earlier version of the code, but then I made some tweaks and skipped the step where I tested that it worked even with those tweaks.</p>\n<a class=\"footnote-backref\" href=\"#fnref-1\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>Though I would have made a mental note (and if someone more senior had done this, I would have been a bit less forgiving).</p>\n<a class=\"footnote-backref\" href=\"#fnref-2\">↩</a>\n</li>\n<li id=\"fn-3\">\n<p>Though they may not forget them. More on that later.</p>\n<a class=\"footnote-backref\" href=\"#fnref-3\">↩</a>\n</li>\n<li id=\"fn-4\">\n<p>It’s probably not that comforting to replace “you screwed up by being incompetent” with “it’s not your fault, it’s the system’s fault for hiring an engineer as incompetent as you”.</p>\n<a class=\"footnote-backref\" href=\"#fnref-4\">↩</a>\n</li>\n<li id=\"fn-5\">\n<p>For more on that, see <a href=\"/how-to-ship\"><em>How I ship projects at large tech companies</em></a>.</p>\n<a class=\"footnote-backref\" href=\"#fnref-5\">↩</a>\n</li>\n<li id=\"fn-6\">\n<p>The classic examples are pacemakers and the Space Shuttle (should that now be Starship/New Glenn)?</p>\n<a class=\"footnote-backref\" href=\"#fnref-6\">↩</a>\n</li>\n</ol>\n</div>",
          "content": "<p>The most shameful thing I did in the workplace was lie to a colleague. It was about ten years ago, I was a fresh-faced intern, and in the rush to deliver something I’d skipped the step of testing my work in staging<sup id=\"fnref-1\"><a class=\"footnote-ref\" href=\"#fn-1\">1</a></sup>. It did not work. When deployed to production, it didn’t work there either. No big deal, in general terms: the page we were working on wasn’t yet customer-facing. But my colleague asked me over his desk whether this worked when I’d tested it, and I said something like “it sure did, no idea what happened”.</p>\n<p>I bet he forgot about it immediately. I could have just messed up the testing (for instance, by accidentally running some different code than the code I pushed), or he knew I’d probably lied, and didn’t really care. I haven’t forgotten about it. Even a decade later, I’m still ashamed to write it down.</p>\n<p>Of course I’m not ashamed about the <em>mistake</em>. I was sloppy to not test my work, but I’ve cut corners since then when I felt it was necessary, and I stand by that decision. I’m ashamed about how I handled it. But even that I understand. I was a kid, trying to learn quickly and prove I belonged in tech. The last thing I wanted to do was to dwell on the way I screwed up. If I were in my colleague’s shoes now, I’d have brushed it off too<sup id=\"fnref-2\"><a class=\"footnote-ref\" href=\"#fn-2\">2</a></sup>. How do I try to handle mistakes now?</p>\n<h3>Handling the emotional reaction</h3>\n<p>The most important thing is to <strong>control your emotions</strong>. If you’re anything like me, your strongest emotional reactions at work will be reserved for the times you’ve screwed up. There are usually two countervailing emotions at play here: the desire to defend yourself, find excuses, and minimize the consequences; and the desire to confess your guilt, abase yourself, and beg for forgiveness. Both of these are traps. </p>\n<p>Obviously making excuses for yourself (or flat-out den",
          "depth": 0.8,
          "published": "2026-02-11T00:00:00+00:00",
          "category": "实战技巧"
        },
        {
          "title": "Revisionist History – Aliens, Secrets and Conspiracies",
          "link": "https://steveblank.com/2026/02/10/revisionist-history-aliens-secrets-and-conspiracies/",
          "source": "steveblank.com",
          "summary": "And ye shall know the truth, and the truth shall make you free” John 8:32 Every once in a while you learn something new that makes you completely rethink how/why an event actually happened.  And then you consider how it affects the rest of our country and our lives. This is one of those stories. [&#8230;]",
          "content": "<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">And ye shall know the truth, and the truth shall make you free” </span></i><i><span style=\"font-weight: 400;\">John 8:32</span></i></p>\n<p><span style=\"font-weight: 400;\">Every once in a while you learn something new that makes you completely rethink how/why an event actually happened. </span></p>\n<p><span style=\"font-weight: 400;\">And then you consider how it affects the rest of our country and our lives.</span></p>\n<p><span style=\"font-weight: 400;\">This is one of those stories.</span></p>\n<hr />\n<p><span style=\"font-weight: 400;\">Over a decade ago, I was a public official and was at one of our commission meetings on the coast of California. A fellow commissioner and I decided to take a long lunchtime walk along the coast. As we chatted, we realized we had both worked on several of the same very classified programs. His involvement was in acquisition and finance, while mine was more deeply connected to the engineering development of the project and hands-on with the operators on site.</span></p>\n<p><b>We Got Our Advanced Technology From Aliens<br />\n</b><span style=\"font-weight: 400;\">While we both were discreet about not talking about specifics, we recognized the projects we had worked on. So you can imagine my surprise when he turned to me and casually said, &#8220;You know this technology came from aliens.&#8221; I laughed, thinking that obviously he must be joking. But as we continued walking he continued on, claiming, “You know the equipment you worked on and stuff that followed came from our secret alien investigation site at <a href=\"https://www.military.com/off-duty/2020/12/18/6-urban-legends-about-wright-patterson-air-force-base.html\" rel=\"noopener\" target=\"_blank\">Wright Patterson Air Force Base</a>. All we did was reverse engineer Alien technology.” This time I stopped in my tracks and looked at him to see if he was smiling. I was puzzled as he looked dead serious. He explained that there ",
          "depth": 0.5,
          "published": "2026-02-10T14:00:42+00:00",
          "category": "行业动态"
        }
      ],
      "total_mentions": 2,
      "avg_depth": 0.65
    }
  ]
}